{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v3.1.0", "signature": {"inputs": {"conv2d_input:0": {"name": "conv2d_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "540"}, {"size": "960"}, {"size": "3"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/flatten/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "514560"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "540"}, {"size": "960"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d/Relu", "op": "_FusedConv2D", "input": ["conv2d_input", "unknown", "unknown_0"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/sequential/max_pooling2d/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential/conv2d/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential/max_pooling2d/MaxPool", "unknown_1", "unknown_2"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/sequential/max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential/conv2d_1/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential/max_pooling2d_1/MaxPool", "unknown_3", "unknown_4"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/sequential/max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential/conv2d_2/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential/max_pooling2d_2/MaxPool", "StatefulPartitionedCall/sequential/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/flatten/Reshape", "unknown_5", "unknown_6"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/dense/Relu", "unknown_7", "unknown_8"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of252.bin", "group1-shard2of252.bin", "group1-shard3of252.bin", "group1-shard4of252.bin", "group1-shard5of252.bin", "group1-shard6of252.bin", "group1-shard7of252.bin", "group1-shard8of252.bin", "group1-shard9of252.bin", "group1-shard10of252.bin", "group1-shard11of252.bin", "group1-shard12of252.bin", "group1-shard13of252.bin", "group1-shard14of252.bin", "group1-shard15of252.bin", "group1-shard16of252.bin", "group1-shard17of252.bin", "group1-shard18of252.bin", "group1-shard19of252.bin", "group1-shard20of252.bin", "group1-shard21of252.bin", "group1-shard22of252.bin", "group1-shard23of252.bin", "group1-shard24of252.bin", "group1-shard25of252.bin", "group1-shard26of252.bin", "group1-shard27of252.bin", "group1-shard28of252.bin", "group1-shard29of252.bin", "group1-shard30of252.bin", "group1-shard31of252.bin", "group1-shard32of252.bin", "group1-shard33of252.bin", "group1-shard34of252.bin", "group1-shard35of252.bin", "group1-shard36of252.bin", "group1-shard37of252.bin", "group1-shard38of252.bin", "group1-shard39of252.bin", "group1-shard40of252.bin", "group1-shard41of252.bin", "group1-shard42of252.bin", "group1-shard43of252.bin", "group1-shard44of252.bin", "group1-shard45of252.bin", "group1-shard46of252.bin", "group1-shard47of252.bin", "group1-shard48of252.bin", "group1-shard49of252.bin", "group1-shard50of252.bin", "group1-shard51of252.bin", "group1-shard52of252.bin", "group1-shard53of252.bin", "group1-shard54of252.bin", "group1-shard55of252.bin", "group1-shard56of252.bin", "group1-shard57of252.bin", "group1-shard58of252.bin", "group1-shard59of252.bin", "group1-shard60of252.bin", "group1-shard61of252.bin", "group1-shard62of252.bin", "group1-shard63of252.bin", "group1-shard64of252.bin", "group1-shard65of252.bin", "group1-shard66of252.bin", "group1-shard67of252.bin", "group1-shard68of252.bin", "group1-shard69of252.bin", "group1-shard70of252.bin", "group1-shard71of252.bin", "group1-shard72of252.bin", "group1-shard73of252.bin", "group1-shard74of252.bin", "group1-shard75of252.bin", "group1-shard76of252.bin", "group1-shard77of252.bin", "group1-shard78of252.bin", "group1-shard79of252.bin", "group1-shard80of252.bin", "group1-shard81of252.bin", "group1-shard82of252.bin", "group1-shard83of252.bin", "group1-shard84of252.bin", "group1-shard85of252.bin", "group1-shard86of252.bin", "group1-shard87of252.bin", "group1-shard88of252.bin", "group1-shard89of252.bin", "group1-shard90of252.bin", "group1-shard91of252.bin", "group1-shard92of252.bin", "group1-shard93of252.bin", "group1-shard94of252.bin", "group1-shard95of252.bin", "group1-shard96of252.bin", "group1-shard97of252.bin", "group1-shard98of252.bin", "group1-shard99of252.bin", "group1-shard100of252.bin", "group1-shard101of252.bin", "group1-shard102of252.bin", "group1-shard103of252.bin", "group1-shard104of252.bin", "group1-shard105of252.bin", "group1-shard106of252.bin", "group1-shard107of252.bin", "group1-shard108of252.bin", "group1-shard109of252.bin", "group1-shard110of252.bin", "group1-shard111of252.bin", "group1-shard112of252.bin", "group1-shard113of252.bin", "group1-shard114of252.bin", "group1-shard115of252.bin", "group1-shard116of252.bin", "group1-shard117of252.bin", "group1-shard118of252.bin", "group1-shard119of252.bin", "group1-shard120of252.bin", "group1-shard121of252.bin", "group1-shard122of252.bin", "group1-shard123of252.bin", "group1-shard124of252.bin", "group1-shard125of252.bin", "group1-shard126of252.bin", "group1-shard127of252.bin", "group1-shard128of252.bin", "group1-shard129of252.bin", "group1-shard130of252.bin", "group1-shard131of252.bin", "group1-shard132of252.bin", "group1-shard133of252.bin", "group1-shard134of252.bin", "group1-shard135of252.bin", "group1-shard136of252.bin", "group1-shard137of252.bin", "group1-shard138of252.bin", "group1-shard139of252.bin", "group1-shard140of252.bin", "group1-shard141of252.bin", "group1-shard142of252.bin", "group1-shard143of252.bin", "group1-shard144of252.bin", "group1-shard145of252.bin", "group1-shard146of252.bin", "group1-shard147of252.bin", "group1-shard148of252.bin", "group1-shard149of252.bin", "group1-shard150of252.bin", "group1-shard151of252.bin", "group1-shard152of252.bin", "group1-shard153of252.bin", "group1-shard154of252.bin", "group1-shard155of252.bin", "group1-shard156of252.bin", "group1-shard157of252.bin", "group1-shard158of252.bin", "group1-shard159of252.bin", "group1-shard160of252.bin", "group1-shard161of252.bin", "group1-shard162of252.bin", "group1-shard163of252.bin", "group1-shard164of252.bin", "group1-shard165of252.bin", "group1-shard166of252.bin", "group1-shard167of252.bin", "group1-shard168of252.bin", "group1-shard169of252.bin", "group1-shard170of252.bin", "group1-shard171of252.bin", "group1-shard172of252.bin", "group1-shard173of252.bin", "group1-shard174of252.bin", "group1-shard175of252.bin", "group1-shard176of252.bin", "group1-shard177of252.bin", "group1-shard178of252.bin", "group1-shard179of252.bin", "group1-shard180of252.bin", "group1-shard181of252.bin", "group1-shard182of252.bin", "group1-shard183of252.bin", "group1-shard184of252.bin", "group1-shard185of252.bin", "group1-shard186of252.bin", "group1-shard187of252.bin", "group1-shard188of252.bin", "group1-shard189of252.bin", "group1-shard190of252.bin", "group1-shard191of252.bin", "group1-shard192of252.bin", "group1-shard193of252.bin", "group1-shard194of252.bin", "group1-shard195of252.bin", "group1-shard196of252.bin", "group1-shard197of252.bin", "group1-shard198of252.bin", "group1-shard199of252.bin", "group1-shard200of252.bin", "group1-shard201of252.bin", "group1-shard202of252.bin", "group1-shard203of252.bin", "group1-shard204of252.bin", "group1-shard205of252.bin", "group1-shard206of252.bin", "group1-shard207of252.bin", "group1-shard208of252.bin", "group1-shard209of252.bin", "group1-shard210of252.bin", "group1-shard211of252.bin", "group1-shard212of252.bin", "group1-shard213of252.bin", "group1-shard214of252.bin", "group1-shard215of252.bin", "group1-shard216of252.bin", "group1-shard217of252.bin", "group1-shard218of252.bin", "group1-shard219of252.bin", "group1-shard220of252.bin", "group1-shard221of252.bin", "group1-shard222of252.bin", "group1-shard223of252.bin", "group1-shard224of252.bin", "group1-shard225of252.bin", "group1-shard226of252.bin", "group1-shard227of252.bin", "group1-shard228of252.bin", "group1-shard229of252.bin", "group1-shard230of252.bin", "group1-shard231of252.bin", "group1-shard232of252.bin", "group1-shard233of252.bin", "group1-shard234of252.bin", "group1-shard235of252.bin", "group1-shard236of252.bin", "group1-shard237of252.bin", "group1-shard238of252.bin", "group1-shard239of252.bin", "group1-shard240of252.bin", "group1-shard241of252.bin", "group1-shard242of252.bin", "group1-shard243of252.bin", "group1-shard244of252.bin", "group1-shard245of252.bin", "group1-shard246of252.bin", "group1-shard247of252.bin", "group1-shard248of252.bin", "group1-shard249of252.bin", "group1-shard250of252.bin", "group1-shard251of252.bin", "group1-shard252of252.bin"], "weights": [{"name": "unknown", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "unknown_0", "shape": [16], "dtype": "float32"}, {"name": "unknown_1", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "unknown_2", "shape": [32], "dtype": "float32"}, {"name": "unknown_3", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "unknown_4", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "unknown_5", "shape": [514560, 512], "dtype": "float32"}, {"name": "unknown_6", "shape": [512], "dtype": "float32"}, {"name": "unknown_7", "shape": [512, 1], "dtype": "float32"}, {"name": "unknown_8", "shape": [1], "dtype": "float32"}]}]}